cucmv2/roles/CUCM_axl_setup/files/AxlCmds/AXL_addPartExternal.txt

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns="http://www.cisco.com/AXL/API/11.5">
   <soapenv:Header/>
   <soapenv:Body>
       <ns:addRoutePartition sequence="?">
         <routePartition>
            <name>External_PT</name> 
            <description>External Partition</description>
            <partitionUsage>General</partitionUsage>
         </routePartition>
       </ns:addRoutePartition>
   </soapenv:Body>
</soapenv:Envelope>

